---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DuctFailures.PartNotFoundDueToNoDuctConnectedWarning
source: html/ec18a02c-635d-3b3f-3f02-42906e2568d2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DuctFailures.PartNotFoundDueToNoDuctConnectedWarning Property

"In order to find a matching part, the fitting has to be connected to a duct."

## Syntax (C#)
```csharp
public static FailureDefinitionId PartNotFoundDueToNoDuctConnectedWarning { get; }
```